Revit 2027 API
PerformanceAdviser.GetRuleDescription(PerformanceAdviserRuleId) Method
 Retrieves the description of the rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetRuleDescription(
	PerformanceAdviserRuleId id
)
Public Function GetRuleDescription (
	id As PerformanceAdviserRuleId
) As String
public:
String^ GetRuleDescription(
	PerformanceAdviserRuleId^ id
)
member GetRuleDescription :
        id : PerformanceAdviserRuleId -> string
Parameters
id PerformanceAdviserRuleId
 The rule id to get information for.
Return Value
String
 The description of the rule.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PerformanceAdviser Class
GetRuleDescription Overload
Autodesk.Revit.DB Namespace